// 1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

for (let i = 20; i <= 30; i += 0.5) {
    console.log(`числа від 20 до 30 крок 0,5 = ${i}`);
}

// 2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
let exchange = 27;
for (let i = 0; i <= 100; i += 10) {
    if (i !== 0) {
        console.log(`${i}$ (по курсу 27)  = ${i * exchange} грн`);
    }
}

// 3 Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let num = 50;
for (let i = 0; i <= 100; i++) {
    if (i * i <= num && i !== 0) {
        console.log(`квадрат числа ${i} не перевищує N = ${num}`);
    }
}

// 4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let number = 68;
let count = 0;
let res;
for (let i = 1; i <= number; i++) {
    if (number % i === 0) {
        count++;
    }
}
if (count >= 3) {
    res = `Має ${count} дільників - Не просте число ${number}`;
} else {
    res = `Має ${count} дільників - Просте число ${number}`;
}
console.log(res);

// 5 Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь.
//(Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let n = 191;
let result;
let end = true;
for (let i = 0; i <= n; i++) {
    if (3 ** i === n) {
        result = `Число ${n} можна отримати шляхом зведення числа 3 у ${i} ступінь `;
        end = false;
        break;
    }
}
if (end === true) {
    result = `Число ${n} не можна отримати шляхом зведення числа 3 у деякий ступінь `;
}

console.log(result);
